Vr2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontback
    {
          type            empty;
        inGroups 1(empty);
        nFaces          148452;
        startFace       110938;
    }
    topbottom
    {
        type            patch;
        physicalType    patch;
        nFaces          334;
        startFace       259390;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          84;
        startFace       259724;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          84;
        startFace       259808;
    }
    walls
    {
        type            wall;
      inGroups 1(wall);
        nFaces          300;
        startFace       259892;
    }
)

// ************************************************************************* //
